rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
/***************************************************************************
 *
 * DTC-1200 & STC-1200 Digital Transport Controllers for
 * Ampex MM-1200 Tape Machines
 *
 * Copyright (C) 2016-2020, RTZ Professional Audio, LLC
 * All Rights Reserved
 *
 * RTZ is registered trademark of RTZ Professional Audio, LLC
 *
 ***************************************************************************
 *
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ***************************************************************************/

/* XDCtools Header files */
#include <xdc/std.h>
#include <xdc/cfg/global.h>
#include <xdc/runtime/System.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Gate.h>
#include <xdc/runtime/Memory.h>

#include <ti/sysbios/BIOS.h>

/* BIOS Header files */
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Mailbox.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/gates/GateMutex.h>

/* TI-RTOS Driver files */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/I2C.h>
#include <ti/drivers/UART.h>
#include <ti/mw/fatfs/ff.h>

#include <file.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdbool.h>
#include <time.h>

#include <driverlib/sysctl.h>
#include <driverlib/hibernate.h>

#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/hal/Seconds.h>

#include "STC1200.h"
#include "Board.h"
#include "Utils.h"
#include "CLITask.h"
#include "SMPTE.h"
#include "RAMPMessage.h"
#include "IPCMessage.h"
#include "IPCCommands.h"
#include "RemoteTask.h"
#include "xmodem.h"

extern SYSDAT g_sys;
extern SYSCFG g_cfg;

//*****************************************************************************
// Type Definitions
//*****************************************************************************

typedef struct {
    const char* name;
    void (*func)(int, char**);
    const char* doc;
} cmd_t;

#define MK_CMD(x) void cmd_ ## x (int, char**)

//*****************************************************************************
// CLI Function Handle Declarations
//*****************************************************************************

MK_CMD(ip);
MK_CMD(mac);
MK_CMD(sn);
MK_CMD(smpte);
MK_CMD(cls);
MK_CMD(help);
MK_CMD(about);
MK_CMD(stop);
MK_CMD(play);
MK_CMD(rew);
MK_CMD(fwd);
MK_CMD(speed);
MK_CMD(time);
MK_CMD(date);
MK_CMD(cue);
MK_CMD(store);
MK_CMD(rtz);
MK_CMD(stat);
MK_CMD(cfg);
MK_CMD(dir);
MK_CMD(cd);
MK_CMD(del);
MK_CMD(xmdm);


/* The dispatch table */
#define CMD(func, help) {#func, cmd_ ## func, help}

cmd_t dispatch[] = {
    CMD(ip, "Displays IP address"),
    CMD(mac, "Displays MAC address"),
    CMD(sn, "Displays serial number"),
    CMD(smpte, "SMPTE generator {start|stop}"),
    CMD(cls, "Clear the screen"),
    CMD(help, "Display this help"),
    CMD(about, "About the system"),
    CMD(stop, "Transport STOP mode"),
    CMD(play, "Transport PLAY {rec} mode"),
    CMD(rew, "Transport REW {lib} mode"),
    CMD(fwd, "Transport FWD {lib} mode"),
    CMD(speed, "Display tape speed"),
    CMD(time, "Display time"),
    CMD(date, "Display date"),
    CMD(cue, "Locator cue {0-9}"),
    CMD(store, "Locator store {0-9}"),
    CMD(rtz, "Return to zero"),
    CMD(stat, "Displays machine status"),
    CMD(cfg, "Configuration {save|load|reset}"),
    CMD(dir, "List directory"),
    CMD(cd, "Change directory"),
    CMD(del, "Delete a file"),
    CMD(xmdm, "Send/Receive File"),
};

#define NUM_CMDS    (sizeof(dispatch)/sizeof(cmd_t))

//*****************************************************************************
// Static and External Data Items
//*****************************************************************************

#define MAX_CHARS       80
#define MAX_ARGS        8
#define MAX_ARG_LEN     16
#define MAX_PATH        256

/*** Static Data Items ***/
static UART_Handle s_handleUart;
static const char *s_delim = " ://\n";
static char s_cmdbuf[MAX_CHARS+3];
static char s_cmdprev[MAX_CHARS+3];

static int   s_argc = 0;
static char* s_argv[MAX_ARGS];
static char  s_args[MAX_ARGS][MAX_ARG_LEN];

/* Current Working Directory */
static char s_cwd[MAX_PATH] = "\\";
static char s_drive = '0';

/*** Function Prototypes ***/
static int parse_args(char *buf);
static void parse_cmd(char *buf);
static bool IsClockRunning(void);
static char *FSErrorString(int errno);
static FRESULT dir_list(char* path);

/*** External Data Items ***/
extern SYSDAT g_sys;
extern SYSCFG g_cfg;

//*****************************************************************************
//
//*****************************************************************************

