rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
    return true;
}

bool IsValidDate(struct tm *p)
{
    // Is valid data read?
    if(((p->tm_mday < 1) || (p->tm_mday > 31)) ||
       ((p->tm_mon < 0) || (p->tm_mon > 11)) ||
       ((p->tm_year < 100) || (p->tm_year > 199)))
    {
        return false;
    }

    return true;
}

char *FSErrorString(int errno)
{
    static char* FSErrorString[] = {
        "Success",
        "A hard error occurred",
        "Assertion failed",
        "Physical drive error",
        "Could not find the file",
        "Could not find the path",
        "The path name format is invalid",
        "Access denied due to prohibited access or directory full",
        "Access denied due to prohibited access",
        "The file/directory object is invalid",
        "The physical drive is write protected",
        "The logical drive number is invalid",
        "The volume has no work area",
        "There is no valid FAT volume",
        "The f_mkfs() aborted due to any parameter error",
        "Could not get a grant to access the volume within defined period",
        "The operation is rejected according to the file sharing policy",
        "LFN working buffer could not be allocated",
        "Too many open files",
        "Given parameter is invalid"
    };

    if (errno > sizeof(FSErrorString)/sizeof(char*))
        return "???";

    return FSErrorString[errno];
}

FRESULT dir_list(char* path)
{
    FRESULT res;
    DIR dir;
    static char buf[_MAX_LFN];
    static FILINFO fno;

    /* Open the directory */
    if ((res = f_opendir(&dir, path)) != FR_OK)
    {
        CLI_printf("%s\n", FSErrorString(res));
    }
    else
    {
        for (;;)
        {
            /* Read a directory item */
            res = f_readdir(&dir, &fno);

            /* Break on error or end of dir */
            if (res != FR_OK || fno.fname[0] == 0)
                break;

            if (fno.fattrib & AM_SYS)
                continue;

            if (fno.fattrib & AM_DIR)
                sprintf(buf, "%-15s", "<DIR>");
            else
                sprintf(buf, "%15u", fno.fsize);

            /* 16-Bit Date Bits Format
             * YYYYYYYMMMMDDDDD
             *
             * bit15:9      Year origin from 1980 (0..127)
             * bit8:5       Month (1..12)
             * bit4:0       Day (1..31)
             */

            CLI_printf("%02u/%02u/%04u  ",
                       (fno.fdate >> 0) & 0x1F,
                       (fno.fdate >> 5) & 0x0F,
                      ((fno.fdate >> 9) & 0x7F) + 1980);

            /* 16-Bit Time Format
             * HHHHHMMMMMMSSSSS
             *
             * bit15:11     Hour (0..23)
             * bit10:5      Minute (0..59)
             * bit4:0       Second / 2 (0..29)
             */

            uint32_t hour = (fno.ftime >> 11) & 0x1F;

            bool pm = false;

            if (hour > 12)
            {
                hour = hour - 12;
                pm = true;
            }

            CLI_printf("%02u:%02u:%02u %s",
                       hour,
                       (fno.ftime >> 5) & 0x3F,
                      ((fno.ftime >> 0) & 0x1F) >> 1,
                       pm ? "PM" : "AM");

            if (fno.lfname)
                CLI_printf("    %s %s\n", buf, fno.lfname);
            else
                CLI_printf("    %s %s\n", buf, fno.fname);
        }

        f_closedir(&dir);
    }

    return res;
}

//*****************************************************************************
// CLI Command Handlers
//*****************************************************************************

void cmd_help(int argc, char *argv[])
{
    char name[16];
    int x, len;
    int i = NUM_CMDS;

    CLI_puts("\nAvailable Commands:\n\n");

    //while(i--)

    for(i=0; i < NUM_CMDS; i++)
    {
        cmd_t cmd = dispatch[i];

        len = strlen(cmd.name);

        for (x=0; x < len; x++)
        {
            name[x] = toupper(cmd.name[x]);
            name[x+1] = 0;

            if (x >= sizeof(name)-1)
                break;
        }

        CLI_printf(" %-10s%s\n", name, cmd.doc);
    }
}

void cmd_about(int argc, char *argv[])
{
    CLI_about();
}

void cmd_cls(int argc, char *argv[])
{
    CLI_home();
}

void cmd_sn(int argc, char *argv[])
{
    char serialnum[64];
    /*  Format the 64 bit GUID as a string */
    GetHexStr(serialnum, g_sys.ui8SerialNumber, 16);
    CLI_printf("%s\n", serialnum);
}

void cmd_ip(int argc, char *argv[])
{
    CLI_printf("%s\n", g_sys.ipAddr);
}

void cmd_mac(int argc, char *argv[])
{
    char mac[32];
    sprintf(mac, "%02X:%02X:%02X:%02X:%02X:%02X",
            g_sys.ui8MAC[0], g_sys.ui8MAC[1], g_sys.ui8MAC[2],
            g_sys.ui8MAC[3], g_sys.ui8MAC[4], g_sys.ui8MAC[5]);
    CLI_printf("%s\n", mac);
}

void cmd_smpte(int argc, char *argv[])
{
    if (argc < 1)
    {
        CLI_puts("Missing Argument\n");
        return;
    }

    CLI_puts("SMPTE generator ");

    if (!g_sys.smpteFound)
    {
        CLI_puts("not installed!\n");
        return;
    }

    if (strcmp(argv[0], "start") == 0)
    {
        SMPTE_generator_start();
        CLI_puts("START\n");
    }
    else if (strcmp(argv[0], "stop") == 0)
    {
        SMPTE_generator_stop();
        CLI_puts("STOP\n");
    }
    else if (strcmp(argv[0], "resume") == 0)
    {
        SMPTE_generator_resume();
        CLI_puts("RESUME\n");
    }
    else if (strcmp(argv[0], "revid") == 0)
    {
        char buf[16];
        uint16_t revid = 0;
        SMPTE_get_revid(&revid);
        sprintf(buf, "REVID %04X\n", revid);
        CLI_puts(buf);
    }
    else
    {
        CLI_puts("\n\nUsage: smpte {start|stop|resume|revid}\n");
    }
}

void cmd_stop(int argc, char *argv[])
{
    CLI_puts("STOP\n");
    Transport_PostButtonPress(S_STOP);
}

void cmd_play(int argc, char *argv[])
{
    uint32_t mask = S_PLAY;

    if (argc)
    {
        if (strcmp(argv[0], "rec") == 0)
            mask |= S_REC;
    }

    CLI_printf("PLAY%s\n", (mask & S_REC) ? "-REC" : "");

    Transport_PostButtonPress(mask);
}

void cmd_fwd(int argc, char *argv[])
{
    uint32_t mask = 0;

    if (argc)
    {
        if (strcmp(argv[0], "lib") == 0)
            mask |= M_LIBWIND;
    }

    CLI_printf("FWD%s\n", (mask & M_LIBWIND) ? "-LIB" : "");

