rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
    Transport_Fwd(0, mask);
}

void cmd_rew(int argc, char *argv[])
{
    uint32_t mask = 0;

    if (argc)
    {
        if (strcmp(argv[0], "lib") == 0)
            mask |= M_LIBWIND;
    }

    CLI_printf("REW%s\n", (mask & M_LIBWIND) ? "-LIB" : "");

    Transport_Rew(0, mask);
}

void cmd_speed(int argc, char *argv[])
{
    CLI_printf("%u IPS\n", g_sys.tapeSpeed);
}

void cmd_rtz(int argc, char *argv[])
{
    LocateSearch(CUE_POINT_HOME, 0);
}

void cmd_cue(int argc, char *argv[])
{
    int loc = 0;

    if (!argc)
    {
        CLI_printf("CUE MODE\n");
        Remote_PostSwitchPress(SW_CUE, 0);
        return;
    }

    loc = atoi(argv[0]);

    if (g_sys.remoteMode != REMOTE_MODE_CUE)
        Remote_PostSwitchPress(SW_CUE, 0);

    CLI_printf("SEARCH TO CUE MEMORY %d\n", loc);

    switch(loc)
    {
    case 0:
        Remote_PostSwitchPress(SW_LOC0, 0);
        break;
    case 1:
        Remote_PostSwitchPress(SW_LOC1, 0);
        break;
    case 2:
        Remote_PostSwitchPress(SW_LOC2, 0);
        break;
    case 3:
        Remote_PostSwitchPress(SW_LOC3, 0);
        break;
    case 4:
        Remote_PostSwitchPress(SW_LOC4, 0);
        break;
    case 5:
        Remote_PostSwitchPress(SW_LOC5, 0);
        break;
    case 6:
        Remote_PostSwitchPress(SW_LOC6, 0);
        break;
    case 7:
        Remote_PostSwitchPress(SW_LOC7, 0);
        break;
    case 8:
        Remote_PostSwitchPress(SW_LOC8, 0);
        break;
    case 9:
        Remote_PostSwitchPress(SW_LOC9, 0);
        break;
    }
}

void cmd_store(int argc, char *argv[])
{
    int loc = 0;

    if (!argc)
    {
        CLI_printf("STORE MODE\n");
        Remote_PostSwitchPress(SW_STORE, 0);
        return;
    }

    loc = atoi(argv[0]);
    CLI_printf("STORE TO MEMORY to %d\n", loc);

    if (g_sys.remoteMode != REMOTE_MODE_STORE)
        Remote_PostSwitchPress(SW_STORE, 0);

    switch(loc)
    {
    case 0:
        Remote_PostSwitchPress(SW_LOC0, 0);
        break;
    case 1:
        Remote_PostSwitchPress(SW_LOC1, 0);
        break;
    case 2:
        Remote_PostSwitchPress(SW_LOC2, 0);
        break;
    case 3:
        Remote_PostSwitchPress(SW_LOC3, 0);
        break;
    case 4:
        Remote_PostSwitchPress(SW_LOC4, 0);
        break;
    case 5:
        Remote_PostSwitchPress(SW_LOC5, 0);
        break;
    case 6:
        Remote_PostSwitchPress(SW_LOC6, 0);
        break;
    case 7:
        Remote_PostSwitchPress(SW_LOC7, 0);
        break;
    case 8:
        Remote_PostSwitchPress(SW_LOC8, 0);
        break;
    case 9:
        Remote_PostSwitchPress(SW_LOC9, 0);
        break;
    }
}

void cmd_stat(int argc, char *argv[])
{
    CLI_printf("\nSystem Status\n\n");
    CLI_printf("  Tape roller tach   : %u\n", (uint32_t)g_sys.tapeTach);
    CLI_printf("  Tape roller errors : %u\n", g_sys.qei_error_cnt);
    CLI_printf("  Encoder position   : %d\n", g_sys.tapePosition);
    CLI_printf("  Tape Speed         : %d IPS\n", g_cfg.tapeSpeed);
    CLI_printf("  RTC clock type     : %s\n", (g_sys.rtcFound) ? "RTC ext" : "cpu");
    CLI_printf("  DCS controller     : ");
    if (g_sys.dcsFound)
        CLI_printf("%d track\n", g_sys.trackCount);
    else
        CLI_printf("(n/a)\n");
    CLI_printf("  SMPTE controller   : ");
    if (g_sys.smpteFound)
        CLI_printf("found\n", g_sys.trackCount);
    else
        CLI_printf("(n/a)\n");
}

void cmd_time(int argc, char *argv[])
{
    char timeFmt[] = "Current time: %d:%02d:%02d\n";
    char timeSet[] = "Time set!\n";
    char timeAs[]  = "Enter time as: hh:mm:ss\n";

    if (g_sys.rtcFound)
    {
        RTCC_Struct ts;

        if (argc == 0)
        {
            if (!IsClockRunning())
                return;

            MCP79410_GetTime(g_sys.handleRTC, &ts);

            CLI_printf(timeFmt, ts.hour, ts.min, ts.sec);
        }
        else if (argc == 3)
        {
            /* Get current time/date */
            MCP79410_GetTime(g_sys.handleRTC, &ts);

            ts.hour    = (uint8_t)atoi(argv[0]);
            ts.min     = (uint8_t)atoi(argv[1]);
            ts.sec     = (uint8_t)atoi(argv[2]);

            MCP79410_SetHourFormat(g_sys.handleRTC, H24);                // Set hour format to military time standard
            MCP79410_EnableVbat(g_sys.handleRTC);                        // Enable battery backup
            MCP79410_SetTime(g_sys.handleRTC, &ts);
            MCP79410_EnableOscillator(g_sys.handleRTC);                  // Start clock by enabling oscillator

            CLI_puts(timeSet);
        }
        else
        {
            CLI_puts(timeAs);
        }
    }
    else
    {
        struct tm stime;

        if (argc == 0)
        {
            // Get the latest time.
            HibernateCalendarGet(&stime);

            // Is valid data read?
            if (!IsValidTime(&stime))
            {
                CLI_puts("Time has not been set yet\n");
            }
            else
            {
                CLI_printf(timeFmt, stime.tm_hour, stime.tm_min, stime.tm_sec);
            }
        }
        else if (argc == 3)
        {
            // Get the latest date and time.
            HibernateCalendarGet(&stime);

            // Set the time values that are to be updated.
            stime.tm_hour = atoi(argv[0]);
            stime.tm_min  = atoi(argv[1]);
            stime.tm_sec  = atoi(argv[2]);

            // Update the calendar logic of hibernation module.
            HibernateCalendarSet(&stime);

            CLI_puts(timeSet);
        }
        else
        {
            CLI_puts(timeAs);
        }
    }
}

void cmd_date(int argc, char *argv[])
{
    char dateFmt[] = "Current date: %d/%d/%d\n";
    char dateSet[] = "Date set!\n";
    char dateAs[]  = "Enter date as: mm/dd/yyyy\n";

    if (g_sys.rtcFound)
     {
        RTCC_Struct ts;

        if (argc == 0)
        {
            if (!IsClockRunning())
                return;

            MCP79410_GetTime(g_sys.handleRTC, &ts);

            CLI_printf(dateFmt, ts.month, ts.date, ts.year+2000);
        }
        else if (argc == 3)
        {
            /* Get current time/date */
            MCP79410_GetTime(g_sys.handleRTC, &ts);

