rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
            ts.month   = (uint8_t)atoi(argv[0]);
            ts.date    = (uint8_t)atoi(argv[1]);
            ts.year    = (uint8_t)(atoi(argv[2]) - 2000);
            ts.weekday = (uint8_t)((ts.date % 7) + 1);

            MCP79410_SetHourFormat(g_sys.handleRTC, H24);                // Set hour format to military time standard
            MCP79410_EnableVbat(g_sys.handleRTC);                        // Enable battery backup
            MCP79410_SetTime(g_sys.handleRTC, &ts);
            MCP79410_EnableOscillator(g_sys.handleRTC);                  // Start clock by enabling oscillator

            CLI_puts(dateSet);
        }
        else
        {
            CLI_puts(dateAs);
        }
     }
    else
    {
        struct tm stime;

        if (argc == 0)
        {
            // Get the latest time.
            HibernateCalendarGet(&stime);

            // Is valid data read?
            if (!IsValidDate(&stime))
            {
                CLI_puts("Date has not been set yet\n");
            }
            else
            {
                CLI_printf(dateFmt,
                           stime.tm_mon,
                           stime.tm_mday,
                           stime.tm_year + 1900);
            }
        }
        else if (argc == 3)
        {
            // Get the latest date and time.
            HibernateCalendarGet(&stime);

            // Set the date values that are to be updated.
            stime.tm_mon  = atoi(argv[0]);
            stime.tm_mday = atoi(argv[1]);
            stime.tm_year = atoi(argv[2]) - 1900;

            // Update the calendar logic of hibernation module.
            HibernateCalendarSet(&stime);

            CLI_puts(dateSet);
        }
        else
        {
            CLI_puts(dateAs);
        }
    }
}

void cmd_cfg(int argc, char *argv[])
{
    if (argc == 1)
    {
        if (strcmp(argv[0], "save") == 0)
        {
            ConfigSave(1);
            CLI_puts("Configuration Saved\n");
        }
        else if (strcmp(argv[0], "load") == 0)
        {
            ConfigLoad(1);
            CLI_puts("Configuration Loaded\n");
        }
        else if (strcmp(argv[0], "reset") == 0)
        {
            ConfigReset(1);
            CLI_puts("Configuration Reset\n");
        }
        else
        {
            CLI_puts("Invalid Option\n");
        }
    }
    else
    {
        CLI_puts("Usage: cfg {save|reset|load}\n");
    }
}

void cmd_cd(int argc, char *argv[])
{
    char *p;
    char *cmd = argv[0];
    char cwd[MAX_PATH];
    FRESULT res;

    if (argc)
    {
        strncpy(cwd, s_cwd, MAX_PATH-1);
        cwd[MAX_PATH-1] = 0;

        if (strlen(argv[0]) > 0)
        {
            if (strcmp(cmd, "..") == 0)
            {
                if (strlen(cwd) > 1)
                {
                    /* Search reverse for last slash */
                    if ((p = strrchr(cwd, '\\')) != NULL)
                    {
                        /* If we're at root, terminate after root slash.
                         * Otherwise, terminate at the slash to trim path.
                         */
                        if (p == &cwd[0])
                            *(p+1) = 0;
                        else
                            *p = 0;

                        strcpy(s_cwd, cwd);
                    }
                }
            }
            else
            {
                if (*cmd == '\\')
                {
                    strcpy(cwd, cmd);
                }
                else
                {
                    if (strlen(cwd) >  1)
                        strcat(cwd, "\\");

                    strcat(cwd, cmd);
                }

                strcpy(s_cwd, cwd);
            }
        }
    }

    /* Attempt to change to the directory path */
    res = f_chdir(s_cwd);

    if (res == FR_OK)
        CLI_printf("%c:%s\n", s_drive, s_cwd);
    else
        CLI_puts("Cannot find path specified.\n");
}

void cmd_dir(int argc, char *argv[])
{
    static char buff[MAX_PATH];

    CLI_printf("\n Directory of %c:%s\n\n", s_drive, s_cwd);

    strcpy(buff, "/");

    if (argc >= 1)
    {
        strncpy(buff, argv[0], sizeof(buff)-1);
        buff[sizeof(buff)-1] = 0;
    }

    dir_list(buff);
}

void cmd_del(int argc, char *argv[])
{
    FRESULT res;

    if ((res = f_unlink(argv[0])) != FR_OK)
    {
        CLI_printf("%s", FSErrorString(res));
    }
    CLI_putc('\n');
}

void cmd_xmdm(int argc, char *argv[])
{
    int rc = 0;
    FIL fp;
    FRESULT res = FR_OK;

    char *eraseEOL = VT100_ERASE_EOL;

    CLI_putc('\n');

    if (argc != 2)
    {
        CLI_printf("Usage:\n\n");
        CLI_printf("xmdm s {filename}\t[sends a file]\n");
        CLI_printf("xmdm r {filename}\t[receives a file]\n");
        return;
    }

    if (toupper(*argv[0]) == 'R')
    {
        /* Receive a file */
        if ((res = f_open(&fp, argv[1], FA_WRITE|FA_CREATE_NEW|FA_CREATE_ALWAYS)) == FR_OK)
        {
            CLI_printf("XMODEM Receive Ready\n");

            /* Receive file via XMODEM */
            rc = xmodem_receive(s_handleUart, &fp);

            f_close(&fp);

            if (rc != XMODEM_SUCCESS)
            {
                /* Delete the file, it's not valid */
                f_unlink(argv[1]);

                CLI_printf("\r%s\rReceive Error %d\n", eraseEOL, rc);
            }
            else
            {
                CLI_printf("\r%s\rReceive Complete\n", eraseEOL);
            }
        }
        else
        {
            CLI_printf("Error: %s\n", FSErrorString(res));
        }
    }
    else if (toupper(*argv[0]) == 'S')
    {
        /* Send a file */
        if ((res = f_open(&fp, argv[1], FA_READ)) == FR_OK)
        {
            CLI_printf("XMODEM Send Ready\n");

            /* Send file via XMODEM */
            rc = xmodem_send(s_handleUart, &fp);

            f_close(&fp);

            if (rc != XMODEM_SUCCESS)
            {
                CLI_printf("\r%s\rSend Error %d\n", eraseEOL, rc);
            }
            else
            {
                CLI_printf("\r%s\rSend Complete\n", eraseEOL);
            }
        }
        else
        {
            CLI_printf("%s\n", FSErrorString(res));
        }
    }
    else
    {
        CLI_printf("Invalid Option\n");
    }
}

// End-Of-File
